# Nurbs Surface Data Get Number Of Knots V Method

Source: https://www.revitapidocs.com/2026/f3ce0067-4d8d-6f2b-3609-7906abda5a58.htm

---

| Nurbs Surface Data Get Number Of Knots V Method |
| --- |

Get the number of knots in the v\-direction.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int GetNumberOfKnotsV()
```

```
Public Function GetNumberOfKnotsV As Integer
```

```
public:
int GetNumberOfKnotsV()
```

```
member GetNumberOfKnotsV : unit -> int
```

#### Return Value

Int32 See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace